#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти


#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаблокироватьОбъект()
	
	ЗаблокироватьОбъектНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьОбъектНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.ОбъектБлокировки);
	
	ЗаблокированыДругимПользователем = ОбработкаОбъект.Заблокировать(МассивОбъектов, Объект.ВремяОжидания);
	
	Если ЗаблокированыДругимПользователем.Количество() Тогда
		
		Информация = "";
		
		МассивЗаблокированных = Новый Массив;
		Для каждого ЭлеметБлокировки Из ЗаблокированыДругимПользователем Цикл
			
			МассивЗаблокированных.Добавить(Строка(ЭлеметБлокировки));
					
		КонецЦикла; 
		
		Информация = СтрСоединить(МассивЗаблокированных,Символы.ПС);
		
	КонецЕсли; 
	
	
КонецПроцедуры


#КонецОбласти