#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Заблокировать(МассивОбъектов, ВремяОжидания) Экспорт 
	
	Возврат Расш1_МенеджерПрограммнойБлокировки.Заблокировать(МассивОбъектов,ВремяОжидания); 
	
КонецФункции


#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

ВремяОжидания = 60; // минута


#Иначе
 ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли


